app/views/portfolios/show.html.erb

<h2>Technologies Used:</h2>
<% @portfolio_item.technologies.each do |t| %>
---
SELECT "technologies".* FROM "technologies" WHERE "technologies"."portfolio_id" = $1  [["portfolio_id", 15]]