app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT  "blogs".* FROM "blogs" LIMIT $1  [["LIMIT", 1]]

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["body", ""], ["created_at", "2022-09-23 21:40:37.295982"], ["updated_at", "2022-09-23 21:40:37.295982"], ["slug", "8a0b7019-8bc8-41be-b468-dcc109efa8d5"]]

  def destroy
    @blog.destroy
---
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 1]]

    def set_blog
      @blog = Blog.friendly.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]