app/controllers/portfolios_controller.rb

    def index
        @portfolio_item = Portfolio.all
---
SELECT "portfolios".* FROM "portfolios"

    def create
        @portfolio_item = Portfolio.new(portfolio_params)

            respond_to do |format|
                if @portfolio_item.save
---
INSERT INTO "portfolios" ("title", "subtitle", "body", "main_image", "thumb_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @portfolio_item = Portfolio.find(params[:id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

    def destroy
        #Destroy/delete the record
        @portfolio_item.destroy
---
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 10]]

    def set_portfolio_item
        @portfolio_item =  Portfolio.find(params[:id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]